Revit 2022 API
RevisionSettings.GetAlphanumericRevisionSettings Method
 Returns a copy of the AlphanumericRevisionSettings owned by this RevisionSettings object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2016
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use `RevisionNumberingSequence.GetAllRevisionNumberingSequences` instead.")]
public AlphanumericRevisionSettings GetAlphanumericRevisionSettings()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use `RevisionNumberingSequence.GetAllRevisionNumberingSequences` instead.")> _
Public Function GetAlphanumericRevisionSettings As AlphanumericRevisionSettings
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use `RevisionNumberingSequence.GetAllRevisionNumberingSequences` instead.")]
public:
AlphanumericRevisionSettings^ GetAlphanumericRevisionSettings()
Return Value
 The copy of the AlphaumericRevisionSettings owned by this RevisionSettings object.
See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace